app/views/users/show.html.erb

<div class="ui link cards">
  <% if @user.courses.any? %>
---
SELECT  1 AS one FROM "courses" INNER JOIN "user_courses" ON "courses"."id" = "user_courses"."course_id" WHERE "user_courses"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "user_courses" ON "courses"."id" = "user_courses"."course_id" WHERE "user_courses"."user_id" = ?  [["user_id", 1]]