app/views/layouts/_header.html.erb

  if logged_in? && session[:course_time] && request.original_url.include?('coursewatch')
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]